Revit.Elements.CurtainSystem
A Revit CurtainSystem

Revit.Elements.CurtainSystem.InternalCurtainSystem
An internal handle on the Revit CurtainSystem

Revit.Elements.CurtainSystem.InternalElement
Reference to the Element

Revit.Elements.CurtainSystem.#ctor(Autodesk.Revit.DB.CurtainSystem)
Private constructor

Revit.Elements.CurtainSystem.#ctor(Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.CurtainSystemType)
Private constructor

Revit.Elements.CurtainSystem.InitCurtainSystem(Autodesk.Revit.DB.CurtainSystem)
Initialize a CurtainSystem element

Revit.Elements.CurtainSystem.InitCurtainSystem(Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.CurtainSystemType)
Initialize a CurtainSystem element

Revit.Elements.CurtainSystem.InternalSetCurtainSystem(Autodesk.Revit.DB.CurtainSystem)
Set the InternalCurtainSystem property and the associated element id and unique id
curtainSystem:

Revit.Elements.CurtainSystem.ByFace(Autodesk.DesignScript.Geometry.Surface,Revit.Elements.CurtainSystemType)
Create Curtain System from face references
face:
curtainSystemType:
Returns:

Revit.Elements.CurtainSystem.AddCurtainGrid(Autodesk.DesignScript.Geometry.Surface)
Add Curtain Grid
face:

Revit.Elements.CurtainSystem.RemoveCurtainGrid(Autodesk.DesignScript.Geometry.Surface)
Remove Curtain Grid
face:

Revit.Elements.CurtainSystem.CurtainSystemType
Get CurtainSystemType

Revit.Elements.CurtainSystem.FromExisting(Autodesk.Revit.DB.CurtainSystem,System.Boolean)
Create a CurtainSystem from a user selected Element.
curtainSystem:
isRevitOwned:
Returns: